## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aks["blue"].azurerm_kubernetes_cluster.akscluster will be created
  + resource "azurerm_kubernetes_cluster" "akscluster" {
      + automatic_upgrade_channel           = "patch"
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "prvaks-blue"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = true
      + image_cleaner_interval_hours        = 168
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.29"
      + location                            = "northeurope"
      + name                                = "prvaks-blue"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.Network/privateDnsZones/privatelink.northeurope.azmk8s.io"
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "aztf-spoke-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + workload_identity_enabled           = false

      + auto_scaler_profile (known after apply)

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "5834d83c-4d84-4438-8f5d-581fc9f12fa9",
            ]
          + azure_rbac_enabled     = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "defaultpool"
          + node_count           = 3
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_DS2_v2"
          + vnet_subnet_id       = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.Network/virtualNetworks/aztf-spoke-vnet/subnets/akssubnet"
          + workload_runtime     = (known after apply)

          + upgrade_settings {
              + drain_timeout_in_minutes      = 0
              + max_surge                     = "10%"
              + node_soak_duration_in_minutes = 0
            }
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/prvaksblue-mi-cp",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress_application_gateway {
          + effective_gateway_id                 = (known after apply)
          + gateway_id                           = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.Network/applicationGateways/blue-appgw"
          + ingress_application_gateway_identity = (known after apply)
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = false
          + secret_rotation_interval = "2m"
        }

      + kubelet_identity (known after apply)

      + maintenance_window_auto_upgrade {
          + day_of_week = "Sunday"
          + duration    = 4
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = "2024-10-22T00:00:00Z"
          + start_time  = "00:00"
          + utc_offset  = "+00:00"
        }

      + maintenance_window_node_os {
          + day_of_week = "Sunday"
          + duration    = 4
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = "2024-10-22T00:00:00Z"
          + start_time  = "00:00"
          + utc_offset  = "+00:00"
        }

      + monitor_metrics {}

      + network_profile {
          + dns_service_ip     = "192.168.100.10"
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "userDefinedRouting"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "192.168.100.0/24"
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id      = (known after apply)
          + msi_auth_for_monitoring_enabled = true
          + oms_agent_identity              = (known after apply)
        }

      + windows_profile (known after apply)
    }

  # module.eid_role_assignment-aks_admins["blue"].azurerm_role_assignment.eid_group_assignment["5834d83c-4d84-4438-8f5d-581fc9f12fa9"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5834d83c-4d84-4438-8f5d-581fc9f12fa9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service RBAC Cluster Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.eid_role_assignment-aks_rbac_admin["blue"].azurerm_role_assignment.eid_group_assignment["8bd22a44-7497-4eda-b790-c9d2b4e84d4d"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8bd22a44-7497-4eda-b790-c9d2b4e84d4d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service RBAC Cluster Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.eid_role_assignment-aks_users["blue"].azurerm_role_assignment.eid_group_assignment["cc947677-763d-448e-91f4-878d797588e6"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cc947677-763d-448e-91f4-878d797588e6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.laws.azurerm_log_analytics_workspace.laws will be created
  + resource "azurerm_log_analytics_workspace" "laws" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "northeurope"
      + name                            = "prvaks-laws"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "aztf-spoke-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + workspace_id                    = (known after apply)
    }

  # module.role_assignment_agic_appgw["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.Network/applicationGateways/blue-appgw"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks-to-acr["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.ContainerRegistry/registries/prvaksacr"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks_identity_operator["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pod-identity"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks_vm_contributor["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```
</details>